bookers/app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
<% if @book %>
  <% Rails.logger.info "Book object exists: #{@book.errors.any?}" %>