bookers/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "投稿に成功しました。"
      redirect_to book_path(@book.id)
    else
      flash.now[:alert] = "投稿に失敗しました。"
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "a"], ["body", "a"], ["created_at", "2024-10-06 11:06:43.200588"], ["updated_at", "2024-10-06 11:06:43.200588"]]
SELECT "books".* FROM "books"

  def index
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"

  def destroy
    @book = Book.find(params[:id])
   if @book.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 5]]